In [1]:
import numpy as np
import pandas as pd
print(pd.__version__)

1.2.4

In [2]:
myarr=([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
mydf=pd.DataFrame(myarr,index=['A','B','C'],
                  columns=['col1','col2','col3','col4'])
mydf

   col1  col2  col3  col4
A     1     2     3     4
B     5     6     7     8
C     9    10    11    12

In [3]:
mydict={'col1':[1,5,9],'col2':[2,6,10],'col3':[3,7,11],'col4':[4,8,12]}
mydf1=pd.DataFrame(mydict,index=['A','B','C'],columns=['col1','col2','col3','col4'])
mydf1

   col1  col2  col3  col4
A     1     2     3     4
B     5     6     7     8
C     9    10    11    12

In [4]:
mydf.loc['A']['col1']

1

In [5]:
mydf.iloc[0][1]

2

In [6]:

mydf['col5']=[8,88,888]

mydf

#new={'col1':10,'col2':10,'col3':10,'col4':10,'col5':10}
#mydf=mydf.append(new,ignore_index=True)
#mydf=mydf.concat(new,ignore_index=True)
#mydf.loc[10]=[2,5,4,6,7]

   col1  col2  col3  col4  col5
A     1     2     3     4     8
B     5     6     7     8    88
C     9    10    11    12   888

In [7]:
mydf.loc[['A','B'],'col2']=0

mydf

   col1  col2  col3  col4  col5
A     1     0     3     4     8
B     5     0     7     8    88
C     9    10    11    12   888

In [8]:
mydf.dtypes

col1    int64
col2    int64
col3    int64
col4    int64
col5    int64
dtype: object

In [9]:
mydf ['col1'] = pd.to_numeric(mydf['col1'], errors='coerce')
mydf.dtypes

col1    int64
col2    int64
col3    int64
col4    int64
col5    int64
dtype: object

In [10]:
mydf.col1=['{:.2f}'.format(float(x)) for x in mydf.iloc[:,0]]

mydf

   col1  col2  col3  col4  col5
A  1.00     0     3     4     8
B  5.00     0     7     8    88
C  9.00    10    11    12   888

In [11]:
mydf['col2']=mydf['col2'].apply (lambda x:'{:.2f}'.format(float(x)))

mydf

   col1   col2  col3  col4  col5
A  1.00   0.00     3     4     8
B  5.00   0.00     7     8    88
C  9.00  10.00    11    12   888

In [12]:
df = mydf.astype(float).applymap('{:,.2f}'.format)
df

   col1   col2   col3   col4    col5
A  1.00   0.00   3.00   4.00    8.00
B  5.00   0.00   7.00   8.00   88.00
C  9.00  10.00  11.00  12.00  888.00

In [13]:
mydf1.reset_index(drop=True,inplace=True)
mydf1

   col1  col2  col3  col4
0     1     2     3     4
1     5     6     7     8
2     9    10    11    12

In [14]:
mydf1.drop('col4',axis=1,inplace=True)

mydf1

   col1  col2  col3
0     1     2     3
1     5     6     7
2     9    10    11

In [15]:
mydf1.rename(columns={'c3':'column3'},inplace=True)

mydf1

   col1  col2  col3
0     1     2     3
1     5     6     7
2     9    10    11

In [16]:
mydf1.replace(3,'a')
mydf1

   col1  col2  col3
0     1     2     3
1     5     6     7
2     9    10    11

In [17]:
mydf.applymap(float)
mydf

   col1   col2  col3  col4  col5
A  1.00   0.00     3     4     8
B  5.00   0.00     7     8    88
C  9.00  10.00    11    12   888